# Урок 1. Ввод-Вывод, операторы ветвления
# # Задача 2: Найдите сумму цифр трехзначного числа.
# #
# # *Пример:*
# #
# # 123 -> 6 (1 + 2 + 3)
# # 100 -> 1 (1 + 0 + 0)

# n = int(input('Введите число: '))
# s = 0
# while n > 0:
#     s += n % 10
#     n = (n // 10)
# print('Сумма цифр числа: ', s)


# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно,
# что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
#
# *Пример:*
#
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10


# s = int(input())
# print(f'{s} -> {s//6} {2*s//3} {s//6}')


# Задача 6: Вы пользуетесь общественным транспортом?
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
#
# *Пример:*
#
# 385916 -> yes
# 123456 -> no


# n = int(input('Введите число: '))
# n1 = n
# s1, s2 = 0, 0
# while n1 > 999:
#     s1 += n1 % 10
#     n1 = n1 // 10
#     s2 += (n1 // 100) % 10
# print(n, '->', 'YES' if s1 == s2 else "NO")

# Задача 8: Требуется определить,
# можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
#
# *Пример:*
#
# 3 2 4 -> yes
# 3 2 1 -> no


n, m, k = list(map(int, input('Введите числа в строку через пробел: ').split()))
print(f'{n} {m} {k} ->', 'yes' if n * m > k and k % n == 0 or k % m == 0 else 'no')
# print(n, m, k)
